# Módulo 2 Ejercicio 4

**1. Continuaremos trabajando con nuestros datos de supermercado.  Para esto cargaremos los 4 archivos (clientes, boletas, detalle y productos) y responderemos a las siguientes preguntas:** s:

*a. Generar un DataFrame con cada archivo*

In [36]:
# Importamos librería Pandas
import pandas as pd

# Cargamos la información en una variable y luego las transformamos a DataFrame
clientes = pd.read_csv('clientes.csv', encoding='latin1')
boletas = pd.read_csv('boletas.csv', encoding='latin1')
detalle = pd.read_csv('detalle.csv', encoding='latin1')
productos = pd.read_csv('productos.csv', encoding='latin1')

df_clientes = pd.DataFrame(clientes)
df_boletas = pd.DataFrame(boletas)
df_detalle  = pd.DataFrame(detalle)
df_productos = pd.DataFrame(productos)

In [37]:
# Desplegamos en pantalla el df_clientes
df_clientes

,rut,nombre,direccion,comuna,fecha_nacimiento,telefono,email
0,11223344-4,Tomás Ramírez,NaN,Arica,1994-12-31,NaN,tomas@example.com
1,11223344-5,Laura Rojas,Calle Virtual 567,Antofagasta,1998-07-12,945678321.0,laura@example.com
2,12345678-9,Juan Perez,Calle Falsa 123,Santiago,2000-05-15,912345678.0,juan@example.com
3,23456789-1,Pedro Rodríguez,NaN,Valparaíso,1988-03-10,912345678.0,pedro@example.com
4,33445566-5,Camila Torres,Calle Cibernética 456,NaN,1993-02-14,977894512.0,camila@example.com
5,33445566-7,Mateo Diaz,NaN,Viña del Mar,2002-02-28,967894512.0,mateo@example.com
6,34567890-2,Carla González,Calle Inventada 789,NaN,1999-12-05,934567890.0,carla@example.com
7,45678901-3,Diego Martínez,Avenida Irreal 987,La Serena,NaN,NaN,diego@example.com
8,55667788-6,Matias Castro,Avenida Innovación 321,NaN,1992-06-08,923478965.0,NaN
9,55667788-9,Valentina Herrera,Avenida Tecnológica 123,NaN,1997-04-05,923478965.0,valentina@example.com
10,56789012-4,Ana Lopez,NaN,NaN,1990-08-18,978901234.0,ana@example.com
11,67890123-5,Luisa Fernández,Calle Ficticia 321,Rancagua,2005-04-25,NaN,luisa@example.com
12,77889900-1,Martin Gómez,NaN,Iquique,1996-10-17,955678902.0,martin@example.com
13,77889900-7,Renata Flores,NaN,Copiapó,NaN,NaN,renata@example.com
14,78901234-6,Javier Torres,Avenida de Ensueño 654,Temuco,1985-11-30,923456789.0,NaN
15,87654321-0,Maria Sánchez,Avenida Imaginaria 456,Concepción,1995-10-20,987654321.0,maria@example.com
16,89012345-7,Marta Ramírez,Calle Soñada 210,NaN,NaN,NaN,NaN
17,90123456-8,Daniel Silva,NaN,Puerto Montt,NaN,NaN,NaN
18,99001122-3,Sofía Pérez,Calle Digital 789,NaN,2001-09-22,912345672.0,sofia@example.com
19,99001122-8,Nicolás Ruiz,Calle Programación 210,NaN,2003-11-03,955678902.0,nicolas@example.com

In [38]:
# Desplegamos en pantalla el df_boletas
df_boletas

    numero       fecha rut_cliente
0        1  2023-11-05  12345678-9
1        2  2023-11-07  87654321-0
2        3  2023-11-09  23456789-1
3        4  2023-11-12  34567890-2
4        5  2023-11-15  45678901-3
5        6  2023-11-18  56789012-4
6        7  2023-11-21  67890123-5
7        8  2023-11-24  78901234-6
8        9  2023-11-27  89012345-7
9       10  2023-11-29  90123456-8
10      11  2023-11-02  11223344-5
11      12  2023-11-04  33445566-7
12      13  2023-11-06  55667788-9
13      14  2023-11-08  77889900-1
14      15  2023-11-11  99001122-3
15      16  2023-11-14  11223344-5
16      17  2023-11-17  33445566-7
17      18  2023-11-20  55667788-9
18      19  2023-11-23  77889900-1
19      20  2023-11-26  99001122-3
20      21  2023-11-02  11223344-5
21      22  2023-11-14  11223344-5
22      23  2023-11-05  12345678-9
23      24  2023-11-09  23456789-1

In [39]:
# Desplegamos en pantalla el df_detalle
df_detalle

    numero_boleta  codigo_producto  cantidad
0               1              101         3
1               1              103         6
2               1              106         2
3               2              102         5
4               2              104         1
5               3              107         8
6               3              110         4
7               4              112         7
8               5              113         3
9               6              115         2
10              7              116         5
11              7              119         9
12              8              120         4
13              9              101         6
14              9              104         2
15             10              105         1
16             10              106         3
17             11              107         4
18             11              109         7
19             12              111         5
20             13              112         8
21             14              113         3
22             14              116         1
23             15              117         6
24             16              119         4
25             17              120         2
26             18              101         9
27             18              102         2
28             18              103         5
29             19              104         3
30             19              106         7
31             20              107         1
32             21              120         4
33             21              102         5
34             22              104         1
35             23              101         6
36             23              104         2
37             23              105         1
38             24              116        10
39             24              119        20

In [40]:
# Desplegamos en pantalla el df_productos
df_productos

    codigo            nombre  precio
0      101             Arroz    1500
1      102            Fideos    1200
2      103  Aceite de cocina   18000
3      104            Harina    2000
4      105             Leche    3000
5      106            Azúcar    2500
6      107              Café    5000
7      108               Pan    1500
8      109          Galletas    3500
9      110       Mantequilla    2800
10     111             Queso    6000
11     112             Yogur    2000
12     113      Agua mineral    1200
13     114             Jugos    4000
14     115    Frutas frescas    7000
15     116          Verduras    5500
16     117    Carne de pollo    4800
17     118      Carne de res   10000
18     119           Pescado    9000
19     120            Helado    2500

*b. ¿Cuántos datos tiene cada DataFrame?*

In [41]:
# Creamos mensaje de impresión que incluye código para obtener la cantidad de elementos de cada DataFrame
print('La cantidad de datos en el DataFrame clientes es', df_clientes.size)
print('La cantidad de datos en el DataFrame boletas es', df_boletas.size)
print('La cantidad de datos en el DataFrame detalle es', df_detalle.size)
print('La cantidad de datos en el DataFrame productos es', df_productos.size)

La cantidad de datos en el DataFrame clientes es 140
La cantidad de datos en el DataFrame boletas es 72
La cantidad de datos en el DataFrame detalle es 120
La cantidad de datos en el DataFrame productos es 60

*c. ¿Cuántos clientes no tienen mail?*

In [42]:
# Creamos una variable para obtener la cantidad de datos faltantes en la columna mail del DataFrame clientes
valores_nan_df_clientes = df_clientes['email'].isna().sum()

#  Mostramos el resultado por pantalla
print('La cantidad de clientes que no tienen registrado su mail en la base de datos es:', valores_nan_df_clientes)

La cantidad de clientes que no tienen registrado su mail en la base de datos es: 4

*d. Genera un filtro para saber a qué clientes les falta un dato (cualquiera)*

In [43]:
# Creamos un filtro para obtener las filas del df_clientes que tienen al menos una entrada faltante
df_clientes_info_incompleta = df_clientes.isna().any(axis=1)

# Usamos el df_cilentes_info_incompleta para filtrar la información y obtener el nombre de los  clientes con información incompleta
clientes_falta_data =  df_clientes[df_clientes_info_incompleta]

#Desplegamos en pantalla  los clientes con información incompleta
print('A los clientes que al menos le falta  alguna entrada de datos son:')
df_clientes_falta_data = pd.DataFrame(clientes_falta_data)
df_clientes_falta_data['nombre']

A los clientes que al menos le falta  alguna entrada de datos son:

0         Tomás Ramírez
3       Pedro Rodríguez
4         Camila Torres
5            Mateo Diaz
6        Carla González
7        Diego Martínez
8         Matias Castro
9     Valentina Herrera
10            Ana Lopez
11      Luisa Fernández
12         Martin Gómez
13        Renata Flores
14        Javier Torres
16        Marta Ramírez
17         Daniel Silva
18          Sofía Pérez
19         Nicolás Ruiz
Name: nombre, dtype: object

*e. ¿A cuantos clientes les faltan datos?*

In [44]:
# Configuramos el mensaje para informar la cantidad de clientes con datos faltantes mediante el método .shape[] para contar la cantidad de columnas del df
print('La cantidad de clientes a los que le falta, al menos, un dato es', df_clientes_falta_data.shape[0])

La cantidad de clientes a los que le falta, al menos, un dato es 17

*f. Agregar una nueva columna a todos los clientes, que indique si le falta algún dato o no (con un mapeo)*

In [45]:
# Agregamos una nueva columna con el estado de la información usando el filtro clientes_info_incompleta y método .map() para configurar la información de la columna
df_clientes['info_completa'] = df_clientes_info_incompleta.map({True: 'Falta Información', False: 'Información Completa'})

# Despliega en pantalla el df_clientes con la nueva información agregada
df_clientes

,rut,nombre,direccion,comuna,fecha_nacimiento,telefono,email,info_completa
0,11223344-4,Tomás Ramírez,NaN,Arica,1994-12-31,NaN,tomas@example.com,Falta Información
1,11223344-5,Laura Rojas,Calle Virtual 567,Antofagasta,1998-07-12,945678321.0,laura@example.com,Información Completa
2,12345678-9,Juan Perez,Calle Falsa 123,Santiago,2000-05-15,912345678.0,juan@example.com,Información Completa
3,23456789-1,Pedro Rodríguez,NaN,Valparaíso,1988-03-10,912345678.0,pedro@example.com,Falta Información
4,33445566-5,Camila Torres,Calle Cibernética 456,NaN,1993-02-14,977894512.0,camila@example.com,Falta Información
5,33445566-7,Mateo Diaz,NaN,Viña del Mar,2002-02-28,967894512.0,mateo@example.com,Falta Información
6,34567890-2,Carla González,Calle Inventada 789,NaN,1999-12-05,934567890.0,carla@example.com,Falta Información
7,45678901-3,Diego Martínez,Avenida Irreal 987,La Serena,NaN,NaN,diego@example.com,Falta Información
8,55667788-6,Matias Castro,Avenida Innovación 321,NaN,1992-06-08,923478965.0,NaN,Falta Información
9,55667788-9,Valentina Herrera,Avenida Tecnológica 123,NaN,1997-04-05,923478965.0,valentina@example.com,Falta Información
10,56789012-4,Ana Lopez,NaN,NaN,1990-08-18,978901234.0,ana@example.com,Falta Información
11,67890123-5,Luisa Fernández,Calle Ficticia 321,Rancagua,2005-04-25,NaN,luisa@example.com,Falta Información
12,77889900-1,Martin Gómez,NaN,Iquique,1996-10-17,955678902.0,martin@example.com,Falta Información
13,77889900-7,Renata Flores,NaN,Copiapó,NaN,NaN,renata@example.com,Falta Información
14,78901234-6,Javier Torres,Avenida de Ensueño 654,Temuco,1985-11-30,923456789.0,NaN,Falta Información
15,87654321-0,Maria Sánchez,Avenida Imaginaria 456,Concepción,1995-10-20,987654321.0,maria@example.com,Información Completa
16,89012345-7,Marta Ramírez,Calle Soñada 210,NaN,NaN,NaN,NaN,Falta Información
17,90123456-8,Daniel Silva,NaN,Puerto Montt,NaN,NaN,NaN,Falta Información
18,99001122-3,Sofía Pérez,Calle Digital 789,NaN,2001-09-22,912345672.0,sofia@example.com,Falta Información
19,99001122-8,Nicolás Ruiz,Calle Programación 210,NaN,2003-11-03,955678902.0,nicolas@example.com,Falta Información

*g. A todos los clientes que les falten datos, deben rellenarse con un S/I, excepto la fecha de nacimiento*

In [46]:
# Creamos una variable que nos permita identificar las columnas que no se deben rellenar con método columns.difference()
columnas_a_rellenar = df_clientes.columns.difference(['fecha_nacimiento'])

# Usamos el método .fillna() para rellenar el df_clientes reemplazando NaN por 'S/I'"Nueva carpeta"
df_clientes[columnas_a_rellenar] = df_clientes[columnas_a_rellenar].fillna('S/I')

# Desplegamos el df_clientes actualizado con la nueva información
df_clientes

,rut,nombre,direccion,comuna,fecha_nacimiento,telefono,email,info_completa
0,11223344-4,Tomás Ramírez,S/I,Arica,1994-12-31,S/I,tomas@example.com,Falta Información
1,11223344-5,Laura Rojas,Calle Virtual 567,Antofagasta,1998-07-12,945678321.0,laura@example.com,Información Completa
2,12345678-9,Juan Perez,Calle Falsa 123,Santiago,2000-05-15,912345678.0,juan@example.com,Información Completa
3,23456789-1,Pedro Rodríguez,S/I,Valparaíso,1988-03-10,912345678.0,pedro@example.com,Falta Información
4,33445566-5,Camila Torres,Calle Cibernética 456,S/I,1993-02-14,977894512.0,camila@example.com,Falta Información
5,33445566-7,Mateo Diaz,S/I,Viña del Mar,2002-02-28,967894512.0,mateo@example.com,Falta Información
6,34567890-2,Carla González,Calle Inventada 789,S/I,1999-12-05,934567890.0,carla@example.com,Falta Información
7,45678901-3,Diego Martínez,Avenida Irreal 987,La Serena,NaN,S/I,diego@example.com,Falta Información
8,55667788-6,Matias Castro,Avenida Innovación 321,S/I,1992-06-08,923478965.0,S/I,Falta Información
9,55667788-9,Valentina Herrera,Avenida Tecnológica 123,S/I,1997-04-05,923478965.0,valentina@example.com,Falta Información
10,56789012-4,Ana Lopez,S/I,S/I,1990-08-18,978901234.0,ana@example.com,Falta Información
11,67890123-5,Luisa Fernández,Calle Ficticia 321,Rancagua,2005-04-25,S/I,luisa@example.com,Falta Información
12,77889900-1,Martin Gómez,S/I,Iquique,1996-10-17,955678902.0,martin@example.com,Falta Información
13,77889900-7,Renata Flores,S/I,Copiapó,NaN,S/I,renata@example.com,Falta Información
14,78901234-6,Javier Torres,Avenida de Ensueño 654,Temuco,1985-11-30,923456789.0,S/I,Falta Información
15,87654321-0,Maria Sánchez,Avenida Imaginaria 456,Concepción,1995-10-20,987654321.0,maria@example.com,Información Completa
16,89012345-7,Marta Ramírez,Calle Soñada 210,S/I,NaN,S/I,S/I,Falta Información
17,90123456-8,Daniel Silva,S/I,Puerto Montt,NaN,S/I,S/I,Falta Información
18,99001122-3,Sofía Pérez,Calle Digital 789,S/I,2001-09-22,912345672.0,sofia@example.com,Falta Información
19,99001122-8,Nicolás Ruiz,Calle Programación 210,S/I,2003-11-03,955678902.0,nicolas@example.com,Falta Información

*h. Busque en los productos si existe algún outlier*

In [47]:
# Calculamos el rango intercuartil (IQR) para la columna de precios
Q1 = df_productos['precio'].quantile(0.25)
Q3 = df_productos['precio'].quantile(0.75)
IQR = Q3 - Q1

# Definimos los límites inferior y superior basados en el IQR
limite_inferior = Q1 - 1.5 * IQR
limite_superior = Q3 + 1.5 * IQR

# Filtra y segrega los productos outliers del DataFrame
productos_outliers = df_productos[(df_productos['precio'] < limite_inferior) | (df_productos['precio'] > limite_superior)]

print('Los productos outlier en el df_productos son:')
print(productos_outliers)

Los productos outlier en el df_productos son:
   codigo            nombre  precio
2     103  Aceite de cocina   18000

**2. El archivo “M3E4 - titanic.csv” contiene información sobre los pasajeros del Titanic. Escribir un programa con los siguientes requisitos:**

*a. Generar un DataFrame con los datos del fichero*

In [48]:
# Importamos librería pandas
import pandas as pd

# Cargamos los datos del archivo titanic.csv y lo convertimos a un dataFrame
titanic = pd.read_csv('Titanic.csv')

df_titanic = pd.DataFrame(titanic)

df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

*b. Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las primeras 10 filas y las 10 últimas filas*

In [49]:
dimensiones_df = list(df_titanic.shape)
q_datos_en_df = df_titanic.size
df_nombre_columnas = pd.DataFrame(df_titanic)
nombre_columnas_df = df_nombre_columnas.columns.tolist()
nombre_filas_df = df_titanic.index.tolist()

print(f'- Las dimensiones del DataFrame Titanic es de {dimensiones_df[0]} filas por {dimensiones_df[1]} columnas')
print('')
print(f'- El DataFrame Titanic contiene {q_datos_en_df} datos')
print('')
print('Los nombres de las columnas del DataFrame Titanic son:')
print('-' * 50)
for i in nombre_columnas_df:
    print(i)
print('')
print('-' * 50)
print('- El nombre de las filas del DatFrame Titanic son:')
for i in nombre_filas_df:
    print(i, end=', ')

- Las dimensiones del DataFrame Titanic es de 891 filas por 12 columnas

- El DataFrame Titanic contiene 10692 datos

Los nombres de las columnas del DataFrame Titanic son:
--------------------------------------------------
PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

--------------------------------------------------
- El nombre de las filas del DatFrame Titanic son:
0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701, 702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714, 715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727, 728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740, 741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753, 754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766, 767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779, 780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791, 792, 793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818, 819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 831, 832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 844, 845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857, 858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870, 871, 872, 873, 874, 875, 876, 877, 878, 879, 880, 881, 882, 883, 884, 885, 886, 887, 888, 889, 890,

In [50]:
print('- Las primeras 10 filas del DataFrame Titanic son:')
df_titanic.head(10)

- Las primeras 10 filas del DataFrame Titanic son:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [51]:
print('- Las últimas 10 filas del DataFrame Titanic son:')
df_titanic.tail(10)

- Las últimas 10 filas del DataFrame Titanic son:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

*c. Mostrar por pantalla los datos del pasajero con identificador 148.*

In [52]:
identificador148 = df_titanic.iloc[148]
df_identificador148 = pd.DataFrame(identificador148)
print('- Los datos del pasajero con índice 148 son:')
print('-' * 55)
df_identificador148

- Los datos del pasajero con índice 148 son:
-------------------------------------------------------

                                                  148
PassengerId                                       149
Survived                                            0
Pclass                                              2
Name         Navratil, Mr. Michel ("Louis M Hoffman")
Sex                                              male
Age                                              36.5
SibSp                                               0
Parch                                               2
Ticket                                         230080
Fare                                             26.0
Cabin                                              F2
Embarked                                            S

In [53]:
passengerId148 = df_titanic.loc[df_titanic['PassengerId'] == 148]
df_passengerId148 = pd.DataFrame(passengerId148)
print('- Los datos del pasajero de PassengerId 148 son:')
print('-' * 55)
df_passengerId148

- Los datos del pasajero de PassengerId 148 son:
-------------------------------------------------------

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
147,148,0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.0,2,2,W./C. 6608,34.375,NaN,S

*d. Mostrar por pantalla las filas pares del DataFrame*

In [54]:
df_titanic_filas_indice_par = df_titanic.iloc[::2]

print('- Las filas par del DataFrame (por índice) son:')
print('- '* 50)

df_titanic_filas_indice_par

- Las filas par del DataFrame (por índice) son:
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [55]:
df_titanic_filas_par_por_posicion = df_titanic.iloc[1::2]

print('- Las filas par del DataFrame (por posición) son:')
print('- '* 50)

df_titanic_filas_par_por_posicion

- Las filas par del DataFrame (por posición) son:
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

*e. Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente*

In [56]:
df_1_clase = df_titanic['Pclass'] == 1
df_pclass_1 =  df_titanic[df_1_clase]

df_nombre_pclass_alfa = df_pclass_1['Name']
df_nombre_pclass_alfa_ordenado = df_nombre_pclass_alfa.sort_values()
df_titanic_nombre_pclass_alfa_ordenado = pd.DataFrame(df_nombre_pclass_alfa_ordenado)
df_titanic_nombre_pclass_alfa_ordenado

                                                Name
730                    Allen, Miss. Elisabeth Walton
305                   Allison, Master. Hudson Trevor
297                     Allison, Miss. Helen Loraine
498  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
460                              Anderson, Mr. Harry
..                                               ...
155                      Williams, Mr. Charles Duane
351           Williams-Lambert, Mr. Fletcher Fellows
55                                 Woolner, Mr. Hugh
555                               Wright, Mr. George
325                         Young, Miss. Marie Grice

[216 rows x 1 columns]

*f. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron*

In [57]:
df_survived = df_titanic['Survived'] == 1
df_titanic_survived =  df_titanic[df_survived]
number_survided = df_titanic_survived.shape[0]
number_died = df_titanic.shape[0]  - number_survided
survived_porcentaje = round((number_survided / df_titanic.shape[0] * 100), 2)
died_porcentaje = 100 - survived_porcentaje

print(f'- La cantidad de personas que sobrevieron en Titanic es {number_survided} que equivale al {survived_porcentaje}%.  La cantidad de personas que murieron es {number_died} que equivale al {died_porcentaje}%')

- La cantidad de personas que sobrevieron en Titanic es 342 que equivale al 38.38%.  La cantidad de personas que murieron es 549 que equivale al 61.62%

*g. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase*

In [58]:
clases_en_titanic = df_titanic_survived['Pclass'].unique().tolist()
clases_ordenadas = sorted(clases_en_titanic)
total_tipo_clases = len(clases_ordenadas)



# ------------------------------------------------------------------------

clase1_total = df_titanic[df_titanic.Pclass == 1]['PassengerId'].count()
clase2_total = df_titanic[df_titanic.Pclass == 2]['PassengerId'].count()
clase3_total = df_titanic[df_titanic.Pclass == 3]['PassengerId'].count()

total_x_clase = [clase1_total, clase2_total, clase3_total]

# -----------------------------------------------------------------------

clase1_survived = df_titanic[df_titanic.Pclass == 1]['Survived'].sum()
clase2_survived = df_titanic[df_titanic.Pclass == 2]['Survived'].sum()
clase3_survived = df_titanic[df_titanic.Pclass ==  3]['Survived'].sum()

total_sob_x_clase = [clase1_survived, clase2_survived, clase3_survived]

# -------------------------------------------------------------------------

clase1_died = clase1_total - clase1_survived
clase2_died = clase2_total - clase2_survived
clase3_died = clase3_total - clase3_survived

total_muer_x_clase = [clase1_died, clase2_died, clase3_died]

# ---------------------------------------------------------------------

perc_clase1_surv_por_clase =  round((clase1_survived / clase1_total) * 100, 2)
perc_clase2_surv_por_clase = round((clase2_survived / clase2_total) * 100, 2)
perc_clase3_surv_por_clase = round((clase3_survived / clase3_total) * 100, 2)

porcen_sobr_x_clase = [perc_clase1_surv_por_clase, perc_clase2_surv_por_clase, perc_clase3_surv_por_clase]

# ---------------------------------------------------------------------------

perc_clase1_died_por_clase = 100 - perc_clase1_surv_por_clase
perc_clase2_died_por_clase = 100 - perc_clase2_surv_por_clase
perc_clase3_died_por_clase = 100 - perc_clase3_surv_por_clase

porcen_muer_x_clase = [perc_clase1_died_por_clase, perc_clase2_died_por_clase, perc_clase3_died_por_clase]
# -----------------------------------------------------------------------

perc_clase1_surv_sobre_total = round((clase1_survived / df_titanic.shape[0]) * 100, 2)
perc_clase2_surv_sobre_total = round((clase2_survived / df_titanic.shape[0]) * 100, 2)
perc_clase3_surv_sobre_total = round((clase3_survived / df_titanic.shape[0]) * 100, 2)

porcen_sobr_sobre_total = [perc_clase1_surv_sobre_total, perc_clase2_surv_sobre_total, perc_clase3_surv_sobre_total]

# -------------------------------------------------------------------------------

perc_clase1_died_sobre_total = round((clase1_died / df_titanic.shape[0]) * 100, 2)
perc_clase2_died_sobre_total = round((clase2_died / df_titanic.shape[0]) * 100, 2)
perc_clase3_died_sobre_total = round((clase3_died / df_titanic.shape[0]) * 100, 2)

porc_muer_sobre_total = [perc_clase1_died_sobre_total, perc_clase2_died_sobre_total, perc_clase3_died_sobre_total]


# --------------------------------------------------------------------------

datos_surv_died_titanic = {'Clase' : clases_ordenadas, 'Total Pasajeros' : total_x_clase, 'Sobrevivieron' : total_sob_x_clase, 'Murieron' : total_muer_x_clase,
                           '% Sobrevivieron sobre Clase': porcen_sobr_x_clase, '% Muertos sobre Clase' : porcen_muer_x_clase, '% Sobrevivieron sobre Total' : porcen_sobr_sobre_total, '% Muertos sobre Total' : porc_muer_sobre_total}

df_supervivientes = pd.DataFrame(datos_surv_died_titanic)


df_supervivientes

,Clase,Total Pasajeros,Sobrevivieron,Murieron,% Sobrevivieron sobre Clase,% Muertos sobre Clase,% Sobrevivieron sobre Total,% Muertos sobre Total
0,1,216,136,80,62.96,37.04,15.26,8.98
1,2,184,87,97,47.28,52.72,9.76,10.89
2,3,491,119,372,24.24,75.76,13.36,41.75

*h. Eliminar del DataFrame los pasajeros con edad desconocida*

In [73]:
df_titanic_sin_nan_en_age = df_titanic.dropna(subset=['Age'])
df_titanic_sin_nan_en_age

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

*i. Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase*

In [82]:
df_titanic_female = df_titanic[df_titanic['Sex'] == 'female']
total_mujeres = df_titanic_female.shape[0]

cantidad_mujeres_1_clase = df_titanic_female[df_titanic_female.Pclass == 1]['Age'].count()
suma_años_mujeres_1_clase = df_titanic_female[df_titanic_female.Pclass == 1]['Age'].sum()

cantidad_mujeres_2_clase = df_titanic_female[df_titanic_female.Pclass == 2]['Age'].count()
suma_años_mujeres_2_clase = df_titanic_female[df_titanic_female.Pclass == 2]['Age'].sum()

cantidad_mujeres_3_clase = df_titanic_female[df_titanic_female.Pclass == 3]['Age'].count()
suma_años_mujeres_3_clase = df_titanic_female[df_titanic_female.Pclass == 3]['Age'].sum()

promedio_edad_mujeres_1_clase =  round((suma_años_mujeres_1_clase / cantidad_mujeres_1_clase), 2)
promedio_edad_mujeres_2_clase =  round((suma_años_mujeres_2_clase / cantidad_mujeres_2_clase), 2)
promedio_edad_mujeres_3_clase =  round((suma_años_mujeres_3_clase / cantidad_mujeres_3_clase), 2)

print(f'- La edad promedio de las mujeres que viajaban en primera clase era {promedio_edad_mujeres_1_clase}')
print(f'- La edad promedio de las mujeres que viajaban en segunda clase era {promedio_edad_mujeres_2_clase}')
print(f'- La edad promedio de las mujeres que viajaban en tercera clase era {promedio_edad_mujeres_3_clase}')

- La edad promedio de las mujeres que viajaban en primera clase era 34.61
- La edad promedio de las mujeres que viajaban en segunda clase era 28.72
- La edad promedio de las mujeres que viajaban en tercera clase era 21.75